def show_menu() -> int:
    print("\n" + "=" * 20)
    print("Выберите необходимое действие")
    print("1. Найти сотрудника")
    print("2. Сделать выборку сотрудников по должности")
    print("3. Сделать выборку сотрудников по зарплате")
    print("4. Добавить сотрудника")
    print("5. Удалить сотрудника")
    print("6. Обновить данные сотрудника")
    print("7. Экспортировать данные в формате json")
    print("8. Экспортировать данные в формате cmv")
    print("0. Закончить работу")
    #return int(input("Введите номер необходимого действия: "))

    position = int(input("Введите номер необходимого действия: "))
    while position<0 or position>8:
        print("ошибка ввода")
        position = int(input("Введите номер необходимого действия: "))
    else:
        return position